SproutOrc/MSP430FFT/main.c
#include <MSP430x14x.h>
#include "math.h"
#include "fft.h"
#include "config.h"

#define NUM  128
#define H_NUM NUM/2
// log2(N)
#define SERIES 7

#define PI_TWO 2.0 * 3.141592653

Complex data[NUM];

// set up twiddle constants in factor 
Complex const factor[H_NUM] = {
    {1.000000, -0.000000}, {0.998795, -0.0490677}, {0.995185, -0.0980171}, {0.989177, -0.146730},
    {0.980785, -0.195090}, {0.970031, -0.2429800}, {0.956940, -0.2902850}, {0.941544, -0.336890},
    {0.923880, -0.382683}, {0.903989, -0.4275550}, {0.881921, -0.4713970}, {0.857729, -0.514103},
    {0.831470, -0.555570}, {0.803208, -0.5956990}, {0.773010, -0.6343930}, {0.740951, -0.671559},
    {0.707107, -0.707107}, {0.671559, -0.7409510}, {0.634393, -0.7730100}, {0.595699, -0.803208},
    {0.555570, -0.831470}, {0.514103, -0.8577290}, {0.471397, -0.8819210}, {0.427555, -0.903989},
    {0.382683, -0.923880}, {0.336890, -0.9415440}, {0.290285, -0.9569400}, {0.242980, -0.970031},
    {0.195090, -0.980785}, {0.146730, -0.9891770}, {0.0980172, -0.995185}, {0.0490677, -0.998795},
    {0.000000, -1.000000}, {-0.0490676, -0.998795},{-0.0980171, -0.995185},{-0.14673, -0.989177},
    {-0.19509, -0.980785}, {-0.242980, -0.970031}, {-0.290285, -0.956940}, {-0.33689, -0.941544},
    {-0.382683, -0.92388}, {-0.427555, -0.903989}, {-0.471397, -0.881921}, {-0.514103,-0.857729},
    {-0.55557, -0.831470}, {-0.595699, -0.803208}, {-0.634393, -0.773010}, {-0.671559, -0.740951},
    {-0.707107, -0.707107},{-0.740951, -0.671559}, {-0.773010, -0.634393}, {-0.803208,-0.595699},
    {-0.83147, -0.555570}, {-0.857729, -0.514103}, {-0.881921, -0.471397}, {-0.903989, -0.427555},
    {-0.92388, -0.382683}, {-0.941544, -0.336890}, {-0.956940, -0.290285}, {-0.970031, -0.24298},
    {-0.980785, -0.19509}, {-0.989177, -0.146731}, {-0.995185, -0.0980172},{-0.998795, -0.0490677}
};

void main( void )
{
    int i;
    float sum;
    unsigned char n = 0;
    
    // Stop watchdog timer to prevent time out reset
    WDTCTL = WDTPW + WDTHOLD;
    Clock_Init();
    P6SEL = 0x00;
    P6DIR = 0xff;
    P6OUT = 0xFF;
    
    
    for (i = 0; i < 128; i++) {
        (data + i)->real = (float)(2 * sin(PI_TWO * i / 64));
    }
    FFT(data, factor, NUM, SERIES);
    for (i = 0; i < 64; i++) {
        sum = (
                   (data + i)->real * (data + i)->real 
                 + (data + i)->imag * (data + i)->imag
              );
        
        if (sum > 64.0) {
            n++;
        }
    }
    P6OUT = n;
    LPM4;
    while (1) {
     
    }
}
